{
  "quest_synopsis": "Когда Теневой Мор угрожает поглотить мир в пламени Великого Раздора, юный лорд Эйдан, хранитель последнего чистого Осколка Истины, должен оставить свои фолианты и принять бремя судьбы. Ему предстоит выбрать свой путь: объединять королевства светом дипломатии и чести или же собирать их силой, ступая в тень древних руин и сомнительных сделок. Каждый добытый Осколок будет менять не только карту мира, но и его собственную душу, пока он не столкнется с главным вопросом: достоин ли он владеть Священным Знанием, или оно поглотит его?",
  "initial_stats": {
    "health": 100,
    "honor": 50,
    "wisdom": 10
  },
  "scenes": [
    {
      "scene_id": "act1_call_to_action",
      "text": "Срочный гонец врывается в Зал Памяти. «Лорд Эйдан! — кричит он. — Теневой Мор обрел новую силу на границе!» В тот же миг Осколок в твоей руке вспыхивает, и древнее пророчество разворачивается на алтаре: 'Лишь воссоединение Священного Знания погасит пламя Раздора'. Совет Старейшин смотрит на тебя, ожидая решения. Каков будет твой первый шаг в этот опасный мир?",
      "choices": [
        {
          "text": "«Я пойду Путем Чести. Я отправлюсь к лорду Валерию и буду искать союза открыто».",
          "next_scene": "act2_pathA_valerius_trial",
          "effects": {
            "honor": 10
          }
        },
        {
          "text": "«Я изберу Тайный Путь Мудрости. Я отправлюсь в Древние Руины, ища скрытые знания».",
          "next_scene": "act2_pathB_ruins_entrance",
          "effects": {
            "wisdom": 10
          }
        }
      ]
    },
    {
      "scene_id": "act2_pathA_valerius_trial",
      "text": "Лорд Валерий, человек с седой бородой и усталыми глазами, принимает тебя. 'Вы явились в трудный час, юный лорд', — говорит он. 'Мои земли опустошены. Ваши слова о пророчестве сильны, но лишь действия говорят громче. В Глубоких Топях Теневой Мор собрал силы. Очистите эти земли, и я признаю вас достойным союзником и передам вам наш Осколок'.",
      "choices": [
        {
          "text": "«Я принимаю вызов. Мой меч докажет мою решимость».",
          "next_scene": "act2_pathA_midpoint_revelation",
          "effects": {
            "honor": 15,
            "health": -10
          }
        },
        {
          "text": "«Зачем тратить время? Объединим силы сейчас и ударим вместе!»",
          "next_scene": "act2_pathA_valerius_refusal",
          "effects": {
            "wisdom": 5,
            "honor": -10
          }
        }
      ]
    },
    {
      "scene_id": "act2_pathA_valerius_refusal",
      "text": "«Нетерпеливость — сестра поражения, — холодно отвечает Валерий. — Если вы не готовы доказать свою доблесть, наш разговор окончен». Он отворачивается, и стража вежливо указывает тебе на выход. Ты потерял потенциального союзника и драгоценное время.",
      "choices": [
        {
          "text": "Признать ошибку и искать другие пути.",
          "next_scene": "act3_pathA_setback"
        },
        {
          "text": "Попытаться найти Осколок в его сокровищнице тайно.",
          "next_scene": "loss_honor"
        }
      ]
    },
    {
      "scene_id": "act2_pathA_midpoint_revelation",
      "text": "Ты побеждаешь в Глубоких Топях. Валерий, впечатленный, передает тебе Второй Осколок. Едва они соприкасаются, как твой разум пронзает видение: Тень не просто воюет, она стирает само Знание из реальности. 'Это гонка со временем, Эйдан', — говорит Валерий. — 'Тень ищет не победы, а забвения'.",
      "choices": [
        {
          "text": "«Тогда мы должны спешить! Где следующий хранитель?»",
          "next_scene": "act3_pathA_setback"
        },
        {
          "text": "«Я должен использовать Осколки, чтобы понять, как Тень отравляет умы».",
          "next_scene": "act3_pathA_setback",
          "effects": {
            "wisdom": 5,
            "health": -5
          }
        }
      ]
    },
    {
      "scene_id": "act3_pathA_setback",
      "text": "Ваш путь приводит к развалинам древнего монастыря. Но вместо святыни — оскверненные руины. Староста говорит, что Осколок похитил враг под знаменем Дома Драконьего Пламени, твоего потенциального союзника. Предательство или искусная манипуляция Тени?",
      "choices": [
        {
          "text": "«Я призову их к ответу! Это предательство!» Отправиться в их цитадель.",
          "next_scene": "act3_pathA_climax",
          "effects": {
            "honor": -10
          }
        },
        {
          "text": "«Сначала Мудрость. Я должен понять, как Тень могла их одурачить».",
          "next_scene": "act3_pathA_climax",
          "effects": {
            "wisdom": 10
          }
        }
      ]
    },
    {
      "scene_id": "act3_pathA_climax",
      "text": "Лорд Верон из Дома Драконьего Пламени встречает тебя с холодной учтивостью, отрицая вину. Но ты чувствуешь, что Тень уже здесь, в его глазах, в шепоте его советников. Время для дипломатии вышло. Это последний бой за Осколок и за душу Верона.",
      "choices": [
        {
          "text": "Обвинить Верона в предательстве и вызвать на поединок чести.",
          "next_scene": "ending_good_A",
          "effects": {
            "honor": 20,
            "health": -15
          }
        },
        {
          "text": "Использовать свои Осколки, чтобы прорваться через пелену лжи и показать Верону истинного врага.",
          "next_scene": "ending_neutral_A",
          "effects": {
            "wisdom": 20,
            "honor": 10
          }
        },
        {
          "text": "«Слишком рискованно!» Отступить, чтобы найти другой способ.",
          "next_scene": "ending_catastrophic_failure",
          "effects": {
            "honor": -20
          }
        }
      ]
    },
    {
      "scene_id": "act2_pathB_ruins_entrance",
      "text": "Тайный Путь приводит тебя вглубь забытых земель, к руинам древней цивилизации. Воздух тяжел от веков забвения. Среди развалин ты находишь запечатанную гробницу, откуда исходит пульс Осколка. Вход охраняют фигуры, окутанные Тенью. Они шепчут: 'Мудрость слишком медленна, юный лорд. Возьми силу сейчас, и Аэртрос падет к твоим ногам'.",
      "choices": [
        {
          "text": "Принять темный дар Тени, чтобы обрести силу и мгновенно получить Осколок.",
          "next_scene": "act2_pathB_tainted_shard",
          "effects": {
            "wisdom": 15,
            "honor": -20
          }
        },
        {
          "text": "Отказаться от искушения и сразиться со стражами, полагаясь на свои силы.",
          "next_scene": "act2_pathB_pure_shard",
          "effects": {
            "honor": 15,
            "health": -20
          }
        }
      ]
    },
    {
      "scene_id": "act2_pathB_tainted_shard",
      "text": "Ты произносишь слова, предложенные Тенью. Боль пронзает разум, но сквозь нее приходит озарение. Второй Осколок, темный и холодный, появляется в твоей руке. Он вибрирует с огромной силой, но каждый взгляд на него вызывает головокружение. Ты чувствуешь, что твоя мудрость отравлена.",
      "choices": [
        {
          "text": "«Я подчиню эту силу себе. Она — инструмент, не более».",
          "next_scene": "act3_pathB_black_moment"
        },
        {
          "text": "«Что я наделал?» Попытаться очистить Осколок медитацией.",
          "next_scene": "act3_pathB_black_moment",
          "effects": {
            "wisdom": -5,
            "honor": 5
          }
        }
      ]
    },
    {
      "scene_id": "act2_pathB_pure_shard",
      "text": "Ты отвергаешь шепот Тени. Бой с пробужденными стражами руин был мучительным, но ты победил. Истощенный, но с чистой совестью, ты берешь Второй Осколок. Он сияет ровным светом. Твои силы на исходе, но твоя душа не запятнана.",
      "choices": [
        {
          "text": "Отдохнуть и восстановить силы. Риск — это глупость.",
          "next_scene": "act3_pathB_black_moment",
          "effects": {
            "health": 20
          }
        },
        {
          "text": "Немедленно двигаться дальше. Нельзя давать Тени передышку.",
          "next_scene": "act3_pathB_black_moment",
          "effects": {
            "health": -5
          }
        }
      ]
    },
    {
      "scene_id": "act3_pathB_black_moment",
      "text": "Твои решения приводят к горьким последствиям. Мир узнал о твоих методах, и теперь тебя боятся. Последний Осколок, к которому ты стремился, оказался в руках фанатиков Тени, которые используют его, чтобы натравить на тебя всех, кто еще верит в свет. Ты предан, одинок, и кажется, что весь Аэртрос отвернулся от тебя.",
      "choices": [
        {
          "text": "«Раз они считают меня монстром, я им стану!» Принять тьму полностью.",
          "next_scene": "ending_bad_B",
          "effects": {
            "wisdom": -20,
            "honor": -50
          }
        },
        {
          "text": "«Нет... Еще есть надежда». Собрать последние силы для решающего удара.",
          "next_scene": "act3_pathB_climax",
          "effects": {
            "health": -20,
            "honor": 10
          }
        }
      ]
    },
    {
      "scene_id": "act3_pathB_climax",
      "text": "В своем отчаянии ты находишь ключ к слабости Тени. Ты достигаешь места, где она собирается поглотить Знание — оскверненного храма. Финальный бой — это не только сражение с врагами, но и борьба за твою душу. Как ты нанесешь последний удар?",
      "choices": [
        {
          "text": "Обрушить на врага всю темную мощь, что ты обрел, невзирая на последствия.",
          "next_scene": "ending_neutral_B",
          "effects": {
            "wisdom": 25,
            "honor": -20
          }
        },
        {
          "text": "Попытаться искупить свои ошибки, жертвуя силой ради чистоты Знания.",
          "next_scene": "ending_neutral_A",
          "effects": {
            "wisdom": -10,
            "honor": 20
          }
        }
      ]
    },
    {
      "scene_id": "ending_good_A",
      "text": "Священное Знание восстановлено. Его сияние пронзает тьму, и Великий Раздор утихает. Лорды, вдохновленные твоим примером чести, находят мудрость для единства. Ты становишься истинным Хранителем, и Аэртрос вступает в новую эру мира.",
      "choices": []
    },
    {
      "scene_id": "ending_neutral_A",
      "text": "Война ослабевает, но очаги конфликта тлеют. Ты стал уважаемым лидером, но твой путь к полному объединению Аэртроса еще долог. Тень отступила, но не побеждена. Это хрупкий мир, требующий вечной бдительности.",
      "choices": []
    },
    {
      "scene_id": "ending_neutral_B",
      "text": "Война прекратилась, но мир, который ты принес, построен на страхе перед твоей возросшей мощью. Ты – могущественный правитель, но твой трон стоит на песке, а внутренняя борьба с обретенной тьмой продолжается. Аэртрос спасен, но какой ценой?",
      "choices": []
    },
    {
      "scene_id": "ending_bad_B",
      "text": "Ты пал в безумии, став тираном, поглощенным Тенью, или же был уничтожен ею, оставив Аэртрос на произвол судьбы. Земли погружаются в вечный хаос или попадают под новую, куда более страшную тиранию. Все, что ты пытался спасти, потеряно.",
      "choices": []
    },
    {
      "scene_id": "ending_catastrophic_failure",
      "text": "Твои усилия оказались тщетны. Священное Знание утрачено навсегда, поглощено Тьмой. Аэртрос превращается в безжизненную пустошь, где нет ни света, ни надежды. Ваше имя будет забыто.",
      "choices": []
    },
    {
      "scene_id": "loss_honor",
      "text": "Твоя честь пала так низко, что даже наемники отказываются иметь с тобой дело. Твои бывшие союзники стали врагами. Одинокий и презираемый, ты не можешь продолжать свой путь. Тень побеждает без боя.",
      "choices": []
    }
  ]
}
